
## :white_check_mark: Apply Succeeded (koyashi.ro)

[CI link](https://github.com/koyashiro/infra/actions/runs/8810649371)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_record.cname_cdn: Refreshing state... [id=c4ed764d9bb89337db0ba36849d212bf]
cloudflare_record.cname_blog: Refreshing state... [id=dea0937bfa348d1be822f9566bc48e5e]
cloudflare_record.txt_keybase_site_verification: Refreshing state... [id=9511901ba761348897d7e8cf1a45228c]
cloudflare_record.mx_primary: Refreshing state... [id=255d37959633b15298e109355c0ea57b]
cloudflare_record.mx_alt4: Refreshing state... [id=440de8265d7b3c0bdb0cb96e371f900c]
cloudflare_record.cname_root: Refreshing state... [id=a536905611e54f3561a1a4803c47ec30]
cloudflare_record.txt_google_dkim: Refreshing state... [id=c64c7ba6dbb9f514c02765899360f076]
cloudflare_record.txt_dkim: Refreshing state... [id=d88e55e30d6f87388c78ed7878bf4f1b]
cloudflare_record.txt_dmarc: Refreshing state... [id=5ca18499ecf6c189979f78741466b48c]
cloudflare_record.txt_google_suite_verification: Refreshing state... [id=915ad97f62a8586238c3c2d7511973f9]
cloudflare_record.mx_alt3: Refreshing state... [id=1688eab5753830f72c89aa00be2eaf80]
cloudflare_record.mx_alt1: Refreshing state... [id=212467857bb840bd60a9046d9ed37300]
cloudflare_record.txt_spf: Refreshing state... [id=fb4fafabb68d9df8c88c66ef5de27dca]
cloudflare_record.mx_alt2: Refreshing state... [id=445e5385cf8b0df3539bb30ec02bdbe0]
cloudflare_record.txt_discord: Refreshing state... [id=14eb5ef06ac31307e081d3f550804167]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "koyashiro.pages.dev"
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
cloudflare_record.cname_root: Creating...
cloudflare_record.cname_root: Creation complete after 1s [id=8a8839e610461836a8149951fc8aece5]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":179,"Program":"tfcmt","SHA1":"a0f2f4a05697e0dab4ce23f4df525f40f845d56c","Target":"koyashi.ro","Vars":{},"WorkflowName":"terraform"} -->